/*
 * Завдання 2.
 *
 * Дописати необхідний функціонал щоб код працював правильно.
 *
 * Необхідно змінити перший символ рядка на символ написаний з великої літери
 * і вивести цей рядок на консоль.
 *
 * Приклад 1: привіт -> Привіт
 *
 * Приклад 2: 222 -> Error.
 *
 * Умови:
 * - Необхідно перевірити, що введений текст не число інакше виводити помилку в консоль.
 */

const str = prompt("Введіть будь-який рядок:"); // ЗМІНЯТИ ЗАБОРОНЕНО

function getBetterString (s) {
    if (isNaN((parseInt(s[0])))){
        alert (s[0].toUpperCase() + s.slice(1))
    } else alert("Error.")
}

getBetterString(str)