/**
  * Завдання 1
  *
  * Написати скрипт для додавання, віднімання, множення і ділення двох чисел.
  * Результат кожної операції повинен бути записаний у змінну та виведений у консоль.
  *
  * Приклад: sum1 = 1
  *          sum2 = 2
  *          результат додавання: 3
  *          результат віднімання: -1
  *          результат множення: 2
  *          результат ділення: 0.5
  */

let sum1 = 14
let sum2 = 88

console.log(sum1 + sum2)
console.log(sum1 - sum2)
console.log(sum1 * sum2)
console.log(sum1 / sum2)
