/*
 * Завдання 1.
 *
 * Дописати потрібний функціонал, щоб код працював правильно.
 *
 * Дана вартість у вигляді рядка: $120.
 * Перший символ - валюта, потім - число.
 * Необхідно з такого рядка виділяти число-значення, у даному випадку 120.
 * Зверніть увагу, що потрібно повертати не рядок 120, а саме число 120.
 *
 * Підказка:
 * - Для перевірки на NaN потрібно використовувати isNaN();
 * https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/isNaN
 */

const PRICE = "$" + prompt("Введіть вартість продукту"); // ЗМІНЯТИ ЗАБОРОНЕНО

function getPrice (n) {
    if (!isNaN(n.slice(1))) {
        alert("Вартість продукту: " + parseInt(n.slice(1)))
    }
}

getPrice(PRICE)